fa-xbrl/src/InformationRegisters/velpo_RatingSettings/velpo_RatingSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>velpo_RatingSettings</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>CreditQualityGroup</name>
    <type>
      <types>EnumRef.velpo_CreditQualityGroups</types>
    </type>
  </resources>
  <resources>
    <name>ConsolidatedRating</name>
    <type>
      <types>EnumRef.velpo_ConsolidatedRatings</types>
    </type>
  </resources>
  <resources>
    <name>StandardAndPoors</name>
    <type>
      <types>EnumRef.velpo_StandardAndPoors</types>
    </type>
  </resources>
  <resources>
    <name>MoodysInvestorsService</name>
    <type>
      <types>EnumRef.velpo_MoodysInvestorsService</types>
    </type>
  </resources>
  <resources>
    <name>FitchRatings</name>
    <type>
      <types>EnumRef.velpo_FitchRatings</types>
    </type>
  </resources>
  <resources>
    <name>ExpertRA</name>
    <type>
      <types>EnumRef.velpo_ExpertRA</types>
    </type>
  </resources>
  <resources>
    <name>ACRA</name>
    <type>
      <types>EnumRef.velpo_ACRA</types>
    </type>
  </resources>
  <resources>
    <name>AM_Best</name>
    <type>
      <types>EnumRef.velpo_AM_Best</types>
    </type>
  </resources>
  <attributes>
    <name>VoidDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>RowNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fa-xbrl/src/InformationRegisters/velpo_RatingSettings/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
 
Function GetStructure() Export

	// import
	ClientServer = velpo_ClientServer; 
	                       
	Return ClientServer.GetCashFlowsStructure(); 	

EndFunction // GetItemStructure()

Function GetQueryText() Export
	
	QueryText = 
	"SELECT
	|	RatingSetting.RowNumber,
	|	RatingSetting.CreditQualityGroup,
	|	RatingSetting.ConsolidatedRating,
	|	RatingSetting.StandardAndPoors,
	|	RatingSetting.MoodysInvestorsService,
	|	RatingSetting.FitchRatings,
	|	RatingSetting.ExpertRA,
	|	RatingSetting.ACRA,
	|	RatingSetting.AM_Best
	|FROM
	|	InformationRegister.velpo_RatingSettings.SliceLast(//{PERIOD}
	|																												,
	|																												//{FILTER}
	|																												) AS RatingSetting
	|	//{JOIN}
	|ORDER BY
	|	RatingSetting.RowNumber ASC
	|";
	
	Return QueryText;
	
EndFunction // GetCounterpartyDataQueryText()

#EndIf
